2_Session/test/HP Printer_Wireless/iotTrace_1264.bin

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/print"><soap:Header><wsa:To>http://[fe80::d9f9:ebd9:7242:4961]:5357/f2a58b34-3eb0-49b8-a673-36c5ccebbac7</wsa:To><wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/print/JobEndStateEvent</wsa:Action><wsa:MessageID>urn:uuid:22a50be9-d9a0-1f22-aed7-705a0fe49bc0</wsa:MessageID><wse:Identifier>urn:uuid:6eefdcb6-5075-486a-afe2-4dc6587625f4</wse:Identifier></soap:Header><soap:Body><wprt:JobEndStateEvent> <wprt:JobEndState> <wprt:JobId>9</wprt:JobId> <wprt:JobCompletedState>Aborted</wprt:JobCompletedState> <wprt:JobCompletedStateReasons> <wprt:JobStateReason>JobAbortedByDevice</wprt:JobStateReason> </wprt:JobCompletedStateReasons> <wprt:JobName>C:\Users\Dan\Desktop\udpSender.py</wprt:JobName> <wprt:JobOriginatingUserName>Dan</wprt:JobOriginatingUserName> <wprt:KOctetsProcessed>0</wprt:KOctetsProcessed> <wprt:MediaSheetsCompleted>1</wprt:MediaSheetsCompleted> <wprt:NumberOfDocuments>1</wprt:NumberOfDocuments> </wprt:JobEndState> </wprt:JobEndStateEvent> </soap:Body> </soap:Envelope>