ws-print_getprinterelements.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:pri="http://schemas.microsoft.com/windows/2006/08/wdp/print">
	<soap:Header>
		<wsa:To>{{TO}}</wsa:To>
		<wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/print/GetPrinterElements</wsa:Action>
		<wsa:MessageID>urn:uuid:5df32cda-6096-40a6-9450-a13eaecd3f2c</wsa:MessageID>
		<wsa:ReplyTo>
			<wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:From>
			<wsa:Address>{{FROM}}</wsa:Address>
		</wsa:From>
	</soap:Header>
	<soap:Body>
		<pri:GetPrinterElementsRequest>
			<pri:RequestedElements>
				<pri:Name>pri:PrinterStatus</pri:Name>
				<pri:Name>pri:PrinterDescription</pri:Name>
				<pri:Name>pri:PrinterConfiguration</pri:Name>
			</pri:RequestedElements>
		</pri:GetPrinterElementsRequest>
	</soap:Body>
</soap:Envelope>