2_Session/AllLayers_MAC_L7/HP Printer_Wireless/iot.pcap.TCP_fe80--725a-fff-fee4-9bc0_35379_fe80--d9f9-ebd9-7242-4961_5357_00004_20160923102058.pcap.MAC_705A0FE49BC0.bin

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/print"><soap:Header><wsa:To>http://[fe80::d9f9:ebd9:7242:4961]:5357/f2a58b34-3eb0-49b8-a673-36c5ccebbac7</wsa:To><wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/print/PrinterStatusSummaryEvent</wsa:Action><wsa:MessageID>urn:uuid:22a66f91-df8d-1f22-bd6c-705a0fe49bc0</wsa:MessageID><wse:Identifier>urn:uuid:43b7f0ec-39bc-4f32-95dd-ae8a1d7c5471</wse:Identifier></soap:Header><soap:Body><wprt:PrinterStatusSummaryEvent ><wprt:StatusSummary><wprt:PrinterState>Stopped</wprt:PrinterState><wprt:PrinterPrimaryStateReason>MediaEmpty</wprt:PrinterPrimaryStateReason></wprt:StatusSummary></wprt:PrinterStatusSummaryEvent ></soap:Body></soap:Envelope>