CancelJob.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:pri="http://schemas.microsoft.com/windows/2006/08/wdp/print">
  <soap:Header>
    <wsa:To>%EndPoint%</wsa:To>
    <wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/print/CancelJob</wsa:Action>
    <wsa:MessageID>urn:uuid:%MessageId%</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsa:From>
      <wsa:Address>urn:uuid:%SenderGuid%</wsa:Address>
    </wsa:From>
  </soap:Header>
  <soap:Body>
    <pri:CancelJobRequest>
      <pri:JobId>%JobId%</pri:JobId>
    </pri:CancelJobRequest>
  </soap:Body>
</soap:Envelope>