3_ProcessedSession/FilteredSession/Train/HP Printer_Wireless/iotTrace_1193.bin

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/print"><soap:Header><wsa:To>http://[fe80::d9f9:ebd9:7242:4961]:5357/f2a58b34-3eb0-49b8-a673-36c5ccebbac7</wsa:To><wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/print/PrinterStatusConditionEvent</wsa:Action><wsa:MessageID>urn:uuid:22a66f91-df8d-1f22-b653-705a0fe49bc0</wsa:MessageID><wse:Identifier>urn:uuid:eaf78d09-d78f-4e62-aa3e-00ebeb5ec78a</wse:Identifier></soap:Header><soap:Body><wprt:PrinterStatusConditionEvent><wprt:DeviceCondition Id="8"><wprt:Time>2007-01-01T476:7:41Z</wprt:Time><wprt:Name>InputTraySupplyEmpty</wprt:Name><wprt:Component><wprt:Group>InputBin</wprt:Group><wprt:Name>Tray1</wprt:Name></wprt:Component><wprt:Severity>Critical</wprt:Severity></wprt:DeviceCondition></wprt:PrinterStatusConditionEvent></soap:Body></soap:Envelope>