JobStatusQuery.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/print">
  <soap:Header>
    <wsa:To>%EndPoint%</wsa:To>
    <wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/print/GetJobElements</wsa:Action>
    <wsa:MessageID>urn:uuid:%MessageId%</wsa:MessageID>
  </soap:Header>
  <soap:Body>
    <wprt:GetJobElementsRequest>
      <wprt:JobId>%JobId%</wprt:JobId>
      <wprt:RequestedElements><wprt:Name>wprt:JobStatus</wprt:Name></wprt:RequestedElements>
    </wprt:GetJobElementsRequest >
  </soap:Body>
</soap:Envelope>
