3_ProcessedSession/FilteredSession/Train/HP Printer_Wireless/iotTrace_85.bin

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wprt="http://schemas.microsoft.com/windows/2006/08/wdp/print"><soap:Header><wsa:To>http://[fe80::d9f9:ebd9:7242:4961]:5357/f2a58b34-3eb0-49b8-a673-36c5ccebbac7</wsa:To><wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/print/JobEndStateEvent</wsa:Action><wsa:MessageID>urn:uuid:22a6a2e6-e068-1f22-a14e-705a0fe49bc0</wsa:MessageID><wse:Identifier>urn:uuid:de4ae8d3-0ea4-44ee-a512-be9c0849929d</wse:Identifier></soap:Header><soap:Body><wprt:JobEndStateEvent> <wprt:JobEndState> <wprt:JobId>11</wprt:JobId> <wprt:JobCompletedState>Completed</wprt:JobCompletedState> <wprt:JobCompletedStateReasons> <wprt:JobStateReason>JobCompletedSuccessfully</wprt:JobStateReason> </wprt:JobCompletedStateReasons> <wprt:JobName>C:\Users\Dan\Desktop\a.txt</wprt:JobName> <wprt:JobOriginatingUserName>Dan</wprt:JobOriginatingUserName> <wprt:KOctetsProcessed>18</wprt:KOctetsProcessed> <wprt:MediaSheetsCompleted>1</wprt:MediaSheetsCompleted> <wprt:NumberOfDocuments>1</wprt:NumberOfDocuments> </wprt:JobEndState> </wprt:JobEndStateEvent> </soap:Body> </soap:Envelope>