3_ProcessedSession/FilteredSession/Train/Non-IoT_Wireless/iotTrace_2677.bin

<?xml version="1.0" encoding="UTF-8"?>
         <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:UNS1="http://www.microsoft.com/windows/test/testdevice/11/2005" xmlns:pri="http://schemas.microsoft.com/windows/2006/08/wdp/print" xmlns:xop="http://www.w3.org/2004/08/xop/include"><soap:Header><wsa:To>http://[fe80::725a:fff:fee4:9bc0]:3910</wsa:To><wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/print/SendDocument</wsa:Action><wsa:MessageID>urn:uuid:e14f736d-9fa3-4e7c-926a-e94da6bfae1d</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:From><wsa:Address>urn:uuid:b23a256a-8f02-45fd-8e36-5c575696c13f</wsa:Address></wsa:From><UNS1:ServiceIdentifier>uri:prn</UNS1:ServiceIdentifier></soap:Header><soap:Body><pri:SendDocumentRequest><pri:JobId>10</pri:JobId><pri:DocumentDescription><pri:DocumentId>1</pri:DocumentId><pri:Compression>None</pri:Compression><pri:Format>unknown</pri:Format></pri:DocumentDescription><pri:LastDocument>true</pri:LastDocument><pri:DocumentData><xop:Include href="cid:0@body"></xop:Include></pri:DocumentData></pri:SendDocumentRequest></soap:Body></soap:Envelope>